<html><head><title>DBTracks - Manual for Position Adjustment</title>
<meta http-equiv="Content-Type" content="text/html" charset="iso-8859-1">
<meta http-equiv="imagetoolbar" content="no" />
<meta name=”description” content="Manual for how shapes can take-over the position and direction of a track or road section by Norbert Rieger." />
<meta name=”keywords” content="dbtracks,ustracks,norbert,rieger,dynatrax,profiles,msts,tracks,open,rails,stf,autobahn,bab,train,simulator,microsoft,tiefbau" />
<meta name=”robots” content="index,follow" />
<link rel="stylesheet" href="scripts/mtfb.css"><link rel="shortcut icon" href="DBTracks.ico" />
<script type="text/javascript" src="scripts/dtlang.js"></script><script type="text/javascript"><!--
 var pics=[];
 pics['de']=['mnl2_ma0','mnl1_mp1d','mnl1_mp2','mnl1_mp3','mnl1_mp4d','mnl1_mp5'];
 pics['en']=[pics['de'][0],'mnl1_mp1e',pics['de'][2],pics['de'][3],'mnl1_mp4e',pics['de'][5]];
 pics['fr']=pics['en'];
 nD=new Date(2012,4,26); dlM=nD.toLocaleDateString(); //-->
</script></head>
<body scroll="NO" onload="init()">

<img src="images/dbtracks.png" style="position:absolute;top:3px;left:20px;z-index:1" onclick="lPg(0)">
<h2 id="t00" style="top:69px"><noscript>JAVASCRIPT is required<br>JAVASCRIPT ist erforderlich</noscript></h2><div id="tNav"></div><div id="cntnt">

<table cellspacing="0" cellpadding="0" id="mtab" class="mnl">
<tr><td style="padding:14px 10px"><div id="t01"></div><br><div id="t02"></div></td></tr>
<tr><th><h4 id="t03"></h4></th></tr>
<tr><td><span id="img"></span><img class="rt" id="p0" src="">
	<div class="lst">1.1</div><ul class="mnl"><li id="t04"></li></ul>
	</td>
</tr>
<tr><td><span id="img"></span><img class="rt" id="p1" src="">
	<div class="lst">1.2</div><ul class="mnl"><li id="t05"></li></ul>
	<div class="lst">1.3</div><ul class="mnl"><li id="t06"></li></ul>
	</td>
</tr>
<tr><th><h4 id="t07"></h4></th></tr>
<tr><td><span id="img"></span><img class="rt" id="p2" src="">
	<div class="lst">2.1</div><ul class="mnl"><li id="t08"></li></ul>
	<div class="lst">2.2</div><ul class="mnl"><li id="t09"></li></ul>
	</td>
</tr>
<tr><td><span id="img"></span><img class="rt" id="p3" src="">
	<div class="lst">2.3</div><ul class="mnl"><li id="t10"></li></ul>
	<div class="lst">2.4</div><ul class="mnl"><li id="t11"></li></ul>
	<div class="lst">2.5</div><ul class="mnl"><li id="t12"></li></ul>
	<div class="lst">2.6</div><ul class="mnl"><li id="t13"></li></ul>
	</td>
</tr>
<tr><th><h4 id="t14"></h4></th></tr>
<tr><td><span id="img"></span><img class="rt" id="p4" src="">
	<div class="lst">3.1</div><ul class="mnl"><li id="t15"></li></ul>
	</td>
</tr>
<tr><td><span id="img"></span><img class="rt" id="p5" src="">
	<div class="lst">3.2</div><ul class="mnl"><li id="t16"></li></ul>
	</td>
</tr>
<tr><td><br>&nbsp;</td></tr>
<tr><th><h4 id="t17"></h4></th></tr>
<tr><td class="normal"><br>
	<h4 class="hl" id="t18" style="font-size:1.05em"></h4><ul class="nm">
	<li id="t19"></li>
	<li id="t20"></li>
	</ul>
	<h4 class="hl" id="t21" style="font-size:1.05em"></h4><ul class="nm">
	<li id="t22"></li>
	</ul>
	<h4 class="hl" id="t23" style="font-size:1.05em"></h4><ul class="nm">
	<li id="t24"></li>
	</ul>
	</td></tr>
    <tr style="background-image:none"><td style="padding:4px 2px;border:none;color:#dddddd" id="cpr">&nbsp;</td></tr>
</tr>
</table>
<!----------------------------------------------------------------------------------------------------------------------->
<div id="de" style="display:none">
[t00]Positions&uuml;bernahme im MSTS-Streckeneditor
[t03]Teil 1 - im Streckeneditor:
[t07]Teil 2 - im Texteditor:
[t14]Teil 3 - im Streckeneditor:
[t17]Anmerkungen und Hinweise:
[t18]Warum werden Trassenelemente nicht in Gleisobjekte selbst integriert?
[t21]Warum gibt es keine Rechtsb&uuml;gen?
[t23]Wo kann ich weitere Unterst&uuml;tzung erhalten?
[t01]In dieser Anleitung soll erkl&auml;rt werden, wie Trassenelemente in Lage und Ausrichtung an den Gleisverlauf angepasst werden k&ouml;nnen. Voraussetzung hierbei ist, dass sich der Pivotpunkt der statischen Bauteile am Pivotpunkt des Gleisobjekts orientiert und eine dement&shy;sprechend passende H&ouml;he und Lageausrichtung hat. Ideal ist eine zum Gleisst&uuml;ck passende Dimension.
[t02]Das nachfolgende Beispiel zeigt den Einbau eines Bahndamms aus dem Paket <a href="pages/Bahntrasse1.html"><b>NR_Bahntrasse_1</b></a>. Das Paket enth&auml;lt verschiedene Arten von Kunstbauten f&uuml;r Bahntrassen (Br&uuml;cken, Bahnd&auml;mme, Rampen und St&uuml;tzmauern) f&uuml;r ein- bis viergleisige Strecke, die in Abmessung und Namensgebung leicht den jeweiligen ("A"-)Gleist&uuml;cken aus <a href="http://www.nklj.se/xtracks" target="_blank">XTracks 3.20</a> zugeordnet werden k&ouml;nnen.
[t04]Zu jedem Gleisst&uuml;ck, das einen B&uuml;schungsk&ouml;rper erhalten soll, wird ein B&uuml;schungsobjekt mit den gleichen Ma&szlig;en im Dateinamen an beliebiger Stelle im selben Planquadrat platziert.
[t05]Alle B&uuml;schungsobjekte werden nun der <i>Detailstufe 1</i> zugeordnet und als <i>Terrainobjekt</i> definiert. Die Gleisst&uuml;cke, die einen B&uuml;schungsk&ouml;rper erhalten sollen, werden ebenfalls der Detailstufe 1 zugeordnet.
[t06]Nun wird die Strecke gespeichert (Es gen&uuml;gt, <i>&Auml;nderungen an der Au&szlig;enweltplatzierung</i> zu speichern)
[t08]In einem Text&shy;editor (z.B. <a href="http://www.notetab.com/" target="_blank">Notetab Light</a>) wird die .W-datei des be&shy;arbei&shy;te&shy;ten Planquadrats ge&ouml;ffnet. (im WORLD-Ordner der Strecke)
[t09]Nun wird der erste Eintrag mit <i>StaticDetailLevel ( 1 )</i> gesucht: (alle Eintr&auml;ge eines Detail Levels stehen untereinander.)
[t10]Aus der Beschreibung eines Gleisst&uuml;cks (TrackObj) werden die Zeilen <i>Position</i> und <i>Qdirection</i> markiert und in die Zwischenablage kopiert.
[t11]In der Beschreibung eines Bahndammobjekts (NR_Emb...) werden die gleichnamigen Zeilen markiert und mit den Daten aus der Zwischenablage &uuml;berschrieben (einf&uuml;gen / paste).
[t12]Anschlie&szlig;end werden die Eintr&auml;ge <i>StaticDetailLevel</i> bei beiden Objekten auf <i>0 (Null)</i> ge&auml;ndert, damit ersichtlich ist, dass dieser Eintrag nicht mehr barbeitet werden muss.
[t13]Nun kann die .W-Datei im Texteditor gespeichert werden.
[t15]Um das Ergebnis im Streckeneditor betrachten zu k&ouml;nnen, muss die Strecke <b><i>nicht</i></b> neu geladen werden.<br>Es reicht aus, im Kamerafenster <i>einen weiten Sprung</i> zu unternehmen - z.B. um 1000 Quadrate. Anschlie&szlig;end springt man wieder zur&uuml;ck - und die .W-Datei wurde neu geladen.
[t16]Jetzt befinden sich die B&uuml;schungen exakt am Gleisk&ouml;rper.
[t19]Gleisobjekte k&ouml;nnen keine <i>dynamischen Schatten</i> anzeigen. Das ist nur statischen Objekten m&ouml;glich. Daher ist diese Bauart z.B. f&uuml;r Br&uuml;cken die bessere Variante.
[t20]Gleisobjekte k&ouml;nnen keine <i>Terrainobjekt</i>-Eigenschaft annehmen. Das f&uuml;hrt zu einem unklaren &Uuml;bergang in die Terrainoberfl&auml;che.<br>Diesen Nachteil kann man aber m&ouml;glicherweise - z.B. bei Bahndammb&uuml;schungen - vernachl&auml;ssigen, daher gibt es im Paket <a href="pages/Bahntrasse2.html">NR_Bahntrasse_2</a> entsprechende Objekte, die den Gleisk&ouml;rper mit beinhalten. Die Einbaumethode ist unterschiedlich, deshalb gibt es daf&uuml;r eine eigene Einbauanleitung.
[t22]Wie bei den Gleisen wird bei der Positions&uuml;bernahme der Pivot des Shapes an das gegen&uuml;berliegende Ende verlegt. Bei einem manuellen Einbau muss der Bogen in umgekehrter Richtung eingesetzt werden.
[t24]F&uuml;r weitergehende Fragen stehe ich gern im <a href="http://www.tssf.eu/forum/index.php?topic=1931.0" target="_blank">TSSF-Forum</a> zur Verf&uuml;gung (Anmeldung erforderlich).
</div>
<!----------------------------------------------------------------------------------------------------------------------->
<div id="en" style="display:none">
[t00]Position Adjustment in MSTS Route Editor
[t03]Part 1 - Route Editor:
[t07]Part 2 - Text Editor:
[t14]Part 3 - Route Editor:
[t17]Hints and Comments:
[t18]Why aren&#39;t those path elements combined with track in one object as a track section?
[t21]Where are the right hand curves?
[t23]Where can I get more assistance?
[t01]This manual is intended to explain how path elements can take-over the position and direction of a track or road section. Provided that the pivot point and the direction of the static object fits in with the track section, it would be best to have a selection of static objects with equivalent dimensions as common track sections.
[t02]The following example shows the construction of an embankment, available from the archive <a href="pages/Bahntrasse1.html"><b>NR_Bahntrasse_1</b></a>. The package provides various types of path elements, exactly matching the dimensions of <i>A1t*-A4t*</i> tracks available in <a href="http://www.nklj.se/xtracks" target="_blank">XTracks 3.20</a>. The file names of the static objects can be easily related to the corresponding track sections.
[t04]Place an embankment object with a file name indicating identical dimensions for each track section somewhere nearby. Make sure that you drop it in the same tile as the track section (check the borders by pressing F7).
[t05]Mark all embankment objects as <i>Detail level 1</i> and define it as <i>Terrain object</i>. These settings are available in the <i>Properties</i> dialog window (F6) of a <i>selected</i> item. All tracks sections that have been designated for getting an embankment, should be marked as <i>Detail level 1</i>, too.
[t06]Save the route now (it may be sufficient to save <i>world placement changes</i>). Remember the tile identification (tile x) and (tile z) out of the <i>Camera</i> window.
[t08]Open the tile&#39;s world file in a text editor (e.g. <a href="http://www.notetab.com/" target="_blank">Notetab Light</a>). It is located in the route&#39;s world folder, the file name contains the tile identification numbers and the time stamp should be most up-to-date.
[t09]Search for the first entry containing the string <i>StaticDetailLevel ( 1 )</i> (all other entries on this level can be found subsequently)
[t10]Mark the two rows <i>Position</i> and <i>Qdirection</i> in the <i>TrackObj</i> description and <i>copy</i> it to the clipboard.
[t11]Mark the similar rows in the description of a <i>Static</i> element where <i>FileName ( NR_Emb...)</i> fits the specifications of the track section and <i>paste</i> the content of the clipboard.
[t12]Delete the row <i>StaticDetailLevel ( 1 )</i> in each processed description. This will help you to identify the remaining entries.
[t13]Save the *.w file in text editor.
[t15]To see the changes in Route Editor it is <b><i>not</i></b> necessary to reload the route.<br>Simply do a <i>broad jump</i> - e.g. decrease one of the tile&#39;s numbers by 1000 and click on <i>jump</i>. Then increase the number to the original value and click on <i>jump</i> again. Now you will find the world file reloaded.
[t16]Now the embankment fits together with the track.
[t19]Objects defined as track sections cannot cast <i>dynamic shadows</i> which is a property of static objects only. Therefore it is the best choice to use static objects as described here, at least for bridges.
[t20]Track sections cannot be defined as <i>terrain objects</i>. This may cause an erratic contour where the object reaches into ground. However, this fact may be disregarded for all embankments. So watch out for the second version of this package <a href="pages/Bahntrasse2.html">NR_Bahntrasse_2</a> which will include tracks. The usage of this objects will be slightly different, so it has its own manual.
[t22]Just like track sections seem to be mirrored by pressing 'T', the pivot of the path element will be moved to the other end. If you decide to place such a curved object manually, you have to work in the opposite direction.
[t24]If you have questions, comments or suggestions, please contact the author &nbsp; <a href="mailto:info%40DBTracks.com?subject=Position%20Adjustment"><img src="pages/images/mad/ml30.png" style="position:relative;top:3px"></a>
</div>
<!----------------------------------------------------------------------------------------------------------------------->
<div id="fr" style="display:none">
	[t00]Ajustement de position sous l&#39;&eacute;diteur de routes MSTS
	[t03]Part 1 - &eacute;diteur de route:
	[t07]Part 2 - &eacute;diteur de texte:
	[t14]Part 3 - &eacute;diteur de route:
	[t17]Conseils et commentaires:
	[t18]Pourquoi ces &eacute;l&eacute;ments de chemin ne sont-ils pas combin&eacute;s avec la voie en un seul objet d&eacute;fini comme section de voie?
	[t21]Pourquoi y a t-il des courbes orient&eacute;es vers la droite?
	[t23]Ou puis-je trouver une aide suppl&eacute;mentaire?
	[t01]Ce manuel d&eacute;crit comment des &eacute;l&eacute;ments de chemin peuvent permettre de g&eacute;rer la position et la direction d&#39;une section de voie ou d&#39;une route. Sous r&eacute;serve que le point pivot et la direction de l&#39;objet statique correspondent &agrave; ceux de la section de voie, il est pr&eacute;f&eacute;rable d&#39;avoir une s&eacute;lection d&#39;objets statiques avec des dimensions &eacute;quivalentes &agrave; celles des sections de voie commune.
	[t02]L&#39;exemple suivant illustre la pose d&#39;un talus, disponible dans l&#39;archive <a href="pages/Bahntrasse1.html"><b>NR_Bahntrasse_1</b></a>. Ce pack contient diff&eacute;rents types d&#39;&eacute;l&eacute;ments de chemin, qui correspondent exactement aux dimensions des voies <i>A1t*-A4t*</i> disponibles dans <a href="http://www.nklj.se/xtracks" target="_blank">XTracks 3.20</a>. Les noms de fichier des objets statiques peuvent &ecirc;tre ais&eacute;ment mis en correspondance avec ceux des sections de voies.
	[t04]Pour chaque objet de voie &agrave; modifier, placez un objet de talus portant un nom de fichier indiquant les m&ecirc;mes dimensions que l&#39;objet d&#39;origine. Assurez vous que vous l&#39;ins&eacute;rez bien dans la m&ecirc;me tuile (Tiles) que la section de voie d&#39;origine (v&eacute;rifiez les bords en pressant F7).
	[t05]Marquez tous les objets de talus comme appartenant au niveau de d&eacute;tail 1 <i>(Detail level 1)</i> et comme &eacute;tant des objets de terrain <i>(Terrain object)</i>. Ces param&egrave;tres sont disponibles dans le panneau de dialogue Propri&eacute;t&eacute;s <i>(Properties)</i> de chaque objet s&eacute;lectionn&eacute;, que l&#39;on affiche avec la touche F6. Toutes les sections de voies d&eacute;sign&eacute;es pour recevoir un talus doivent &eacute;galement &eacute;tre marqu&eacute;es comme appartenant au niveau de d&eacute;tail 1 <i>(Detail level 1)</i>.
	[t06]Sauvegardez la route (en fait, il est suffisant de sauvegarder les modifications de placement du monde <i>(world placement changes</i>). Notez l&#39;identifiant de la tuile (Tile X) et (Tile Z) visibles dans la fen&ecirc;tre <i>Cam&eacute;ra</i>.
	[t08]Ouvrir le ficher world de la parcelle avec un &eacute;diteur de texte (par exemple <a href="http://notepad-plus-plus.org/" target="_blank">Notepad++</a> ou <a href="http://www.notetab.com/" target="_blank">Notetab Light</a>). Ce fichier se trouve dans le r&eacute;pertoire World de la route. Son nom comporte le num&eacute;ro d&#39;identification de la parcelle, et la date doit &eacute;tre &agrave; jour.
	[t09]Recherchez la premi&egrave;re occurrence du mot clef <i>StaticDetailLevel ( 1 )</i> (les occurrences suivantes peuvent &eacute;tre recherch&eacute;es par la suite).
	[t10]Marquer les lignes Position et Qdirection dans la description du TrackObj, et copier les dans le presse-papier.
	[t11]Marquer les m&ecirc;mes lignes dans la description d&#39;un objet statique dont le suffixe du nom <i>( NR_Emb... )</i> correspond aux sp&eacute;cifications de la section de voie, puis coller y le contenu du presse-papier.
	[t12]Supprimer la ligne <i>StaticDetailLevel ( 1 )</i> dans chaque description ainsi trait&eacute;e. Cela vous aidera &agrave; rep&eacute;rer les entr&eacute;es suivantes.
	[t13]Sauvegarder le fichier *.w depuis l&#39;&eacute;diteur de texte.
	[t15]Afin de v&eacute;rifier le r&eacute;sultat des manipulations pr&eacute;c&eacute;dentes sous l&#39;&eacute;diteur de mode, <b>il n&#39;est pas n&eacute;cessaire de recharger la route</b>. Il suffit:
		<ol><li>d&#39;effectuer un saut important - par exemple, en r&eacute;duisant de 1000 le num&eacute;ro de parcelle, et en cliquant Sauter <I>(Jump)</I>.</li>
			<li>de revenir ensuite &agrave; la parcelle initiale en restaurant son identifiant en ajoutant 1000, puis en cliquant &agrave; nouveau sur Sauter <I>(Jump)</I>.</ol>L&#39;environnement complet est alors recharg&eacute;.</li></ol>
	[t16]Le talus est d&eacute;sormais adapt&eacute; &agrave; la voie.
	[t19]Les objets d&eacute;finis comme sections de voies ne supportent pas les <I>ombres dynamiques</I>, qui ne s&#39;appliquent qu&#39;&agrave; aux objets statiques. Il est donc plus judicieux d&#39;utiliser de tels objets statiques, du moins pour ce qui concerne les ponts.
	[t20]Les sections de voie ne peuvent pas &eacute;tre d&eacute;finies comme <I>objets de terrain</I>. Cela peut engendrer des contours erratiques &agrave; l&#39;endroit o&ugrave; l&#39;objet rencontre le terrain. Cependant, cela n&#39;est pas vrai pour les talus. Il est donc possible d&#39;utiliser le contenu de la seconde version de ce pack <a href="pages/Bahntrasse2.html">NR_Bahntrasse_2</a>, qui contient ces voies. L&#39;usage de ces objets est l&eacute;g&egrave;rement diff&eacute;rent, et fait l&#39;objet d&#39;un manuel sp&eacute;cifique.
	[t22]Comme les sections de voie apparaissent en miroir avec la touche "T", le point pivot se trouve d&eacute;port&eacute; &agrave; l&#39;autre extr&eacute;mit&eacute;. Si vous d&eacute;cidez de placer manuellement une telle courbe, il faut alors travailler en inversant la direction.
	[t24]En cas de question, il est possible de contacter l&#39;auteur de ces objets: &nbsp; <a href="mailto:info%40DBTracks.com?subject=Position%20Adjustment"><img src="pages/images/mad/ml30.png" style="position:relative;top:3px"></a>	
</div>
<!----------------------------------------------------------------------------------------------------------------------->
</div></body></html>